In [1]:
import pandas as pd
import numpy as np

In [2]:
np.random.seed(121)
marks= np.random.randint(1,100,20).reshape(4,5)

roll = np.arange(101,105)
marks

array([[67, 86,  9, 96, 66],
       [53, 84, 97, 47, 35],
       [53, 61, 55,  4, 95],
       [53, 58, 76, 89, 40]])

In [3]:
sub = ['pds','cn','pe','se','ada']

d =pd.DataFrame(marks,roll,sub)
d

     pds  cn  pe  se  ada
101   67  86   9  96   66
102   53  84  97  47   35
103   53  61  55   4   95
104   53  58  76  89   40

In [4]:
d['pds']

101    67
102    53
103    53
104    53
Name: pds, dtype: int64

In [5]:
d.loc[101]

pds    67
cn     86
pe      9
se     96
ada    66
Name: 101, dtype: int64

In [6]:
d.iloc[3]

pds    53
cn     58
pe     76
se     89
ada    40
Name: 104, dtype: int64

In [7]:
d['pds'][101]

67

In [8]:
d.loc[101]["pds"]

67

In [9]:
d

     pds  cn  pe  se  ada
101   67  86   9  96   66
102   53  84  97  47   35
103   53  61  55   4   95
104   53  58  76  89   40

In [15]:
d.drop("pds",axis=1,inplace=True)

In [16]:
d

     cn  pe  se  ada
101  86   9  96   66
102  84  97  47   35
103  61  55   4   95
104  58  76  89   40

In [19]:
booldata = d>35

In [20]:
d[booldata] # show only pass student

     cn    pe    se   ada
101  86   NaN  96.0  66.0
102  84  97.0  47.0   NaN
103  61  55.0   NaN  95.0
104  58  76.0  89.0  40.0

In [27]:
d.index.name = "Roll No"

In [28]:
d

         cn  pe  se  ada
Roll No
101      86   9  96   66
102      84  97  47   35
103      61  55   4   95
104      58  76  89   40

In [30]:
d.set_index("cn")

    pe  se  ada
cn
86   9  96   66
84  97  47   35
61  55   4   95
58  76  89   40

In [34]:
d.set_index(roll,inplace=True)

In [36]:
d.index.name="Roll No"

In [38]:
d.reset_index(inplace=True)

In [41]:
d.set_index(roll,inplace=True)

In [47]:
d.drop("Roll No",axis=1,inplace=True)

In [48]:
d.index.name="Roll No"

In [49]:
d

         cn  pe  se  ada
Roll No
101      86   9  96   66
102      84  97  47   35
103      61  55   4   95
104      58  76  89   40

In [50]:
dNew = pd.DataFrame(marks,roll,sub)

In [52]:
dNew

     pds  cn  pe  se  ada
101   67  86   9  96   66
102   53  84  97  47   35
103   53  61  55   4   95
104   53  58  76  89   40

In [55]:
bool = dNew>35

In [58]:
nan = dNew[bool]

In [59]:
nan

     pds  cn    pe    se   ada
101   67  86   NaN  96.0  66.0
102   53  84  97.0  47.0   NaN
103   53  61  55.0   NaN  95.0
104   53  58  76.0  89.0  40.0

In [62]:
nan.dropna() # if any NAN is show in row then delete the whole row (who is fully pass)

     pds  cn    pe    se   ada
104   53  58  76.0  89.0  40.0

In [63]:
nan.dropna(axis=1) # if any NAN is show in row then delete the whole Column (who is fully pass)

     pds  cn
101   67  86
102   53  84
103   53  61
104   53  58

In [69]:
nan.fillna("35") #replace the data if Nan at the position

     pds  cn    pe    se   ada
101   67  86    35  96.0  66.0
102   53  84  97.0  47.0    35
103   53  61  55.0    35  95.0
104   53  58  76.0  89.0  40.0

In [70]:
nan.interpolate()

     pds  cn    pe    se   ada
101   67  86   NaN  96.0  66.0
102   53  84  97.0  47.0  80.5
103   53  61  55.0  68.0  95.0
104   53  58  76.0  89.0  40.0

In [72]:
nan.interpolate(method="linear",limit_direction="backward")

     pds  cn    pe    se   ada
101   67  86  97.0  96.0  66.0
102   53  84  97.0  47.0  80.5
103   53  61  55.0  68.0  95.0
104   53  58  76.0  89.0  40.0

In [73]:
nan

     pds  cn    pe    se   ada
101   67  86   NaN  96.0  66.0
102   53  84  97.0  47.0   NaN
103   53  61  55.0   NaN  95.0
104   53  58  76.0  89.0  40.0